import { useState } from "react";

const ProductInfo = () => {
  const [tab, setTab] = useState("description");

  return (
    <section id='description-section'>
      <div className='btn-tab'>
        <button onClick={() => setTab("description")}>توضیحات</button>
        <button onClick={() => setTab("review")}>بررسی</button>
      </div>

      <div className='description'>
        {tab === "description" ? (
          <>
            <div className='description-title'>
              <h1>توضیحات</h1>
            </div>
            <div className='description-body'>
              <p>
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
                برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در
                زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و
                دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
                پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم
                ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
                برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در
                زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و
                دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
                پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
              </p>
            </div>
          </>
        ) : (
          <div className='description-body'>
            <div className='description-title'>
              <h1>بررسی</h1>
            </div>
            <p>
              این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا
              این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه
              تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند، استفاده
              از این متن تستی می تواند سرعت پیشرفت پروژه را افزایش دهد، و طراحان
              به جای تایپ و نگارش متن می توانند تنها با یک کپی و پست این متن را
              در کادرهای مختلف جایگزین نمائید. این نوشته توسط سایت لورم ایپسوم
              فارسی نگاشته شده است. این یک نوشته آزمایشی است که به طراحان و
              برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته
              تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به
              کارفرما نمایش دهند، استفاده از این متن تستی می تواند سرعت پیشرفت
              پروژه را افزایش دهد، و طراحان به جای تایپ و نگارش متن می توانند
              تنها با یک کپی و پست این متن را در کادرهای مختلف جایگزین نمائید.
              این نوشته توسط سایت لورم ایپسوم فارسی نگاشته شده است. این یک نوشته
              آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان
              با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده
              از پروژه و طرح خودشان را به کارفرما نمایش دهند، استفاده از این متن
              تستی می تواند سرعت پیشرفت پروژه را افزایش دهد، و طراحان به جای
              تایپ و نگارش متن می توانند تنها با یک کپی و پست این متن را در
              کادرهای مختلف جایگزین نمائید. این نوشته توسط سایت لورم ایپسوم
              فارسی نگاشته شده است.
            </p>
          </div>
        )}
      </div>
    </section>
  );
};

export default ProductInfo;
